БИТУправление_медицинским_центром_демо/src/InformationRegisters/РезультатыПроверкиКМНаККТ/РезультатыПроверкиКМНаККТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатыПроверкиКМНаККТ</name>
  <resources>
    <name>КодРезультатаПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодМаркировкиПроверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КодОбработкиЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РезультатПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РезультаПроверкиОИСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтатусТовара</name>
    <type>
      <types>EnumRef.ОтветОИСМОСтатусеТовара</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяПолныйКодМаркировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПредставлениеРезультатаПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредставлениеВЧеке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ОказаниеУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/CommonModules/ИнтеграцияМДЛПМедицинаВызовСервера_БИТ/Module.bsl
Функция СтруктураОтбораДляВыбораДокументаПоступления(Знач ОтборИлиЗначенияПолей, Знач ЗапрашиваемыеПоля = Неопределено) Экспорт
	
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ОтборИлиЗначенияПолей)) Тогда
		Отбор = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОтборИлиЗначенияПолей, ЗапрашиваемыеПоля);
	Иначе
		Отбор = ОтборИлиЗначенияПолей;
	КонецЕсли;
	
	Запрос = Новый Запрос(ИнтеграцияМДЛПМедицина_БИТ.ТекстЗапросаДокументовПоступленийДляУведомлений(ТипЗнч(Отбор.Ссылка)));
	
	Для Каждого КлючЗначение Из Отбор Цикл
		Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;
	
	Если Не Отбор.Свойство("МестоДеятельностиГрузоотправителя") Тогда
		Запрос.УстановитьПараметр("МестоДеятельностиГрузоотправителя", Неопределено);
	КонецЕсли;
	
	НовыйОтбор = Новый Структура;
	НовыйОтбор.Вставить("Ссылка", Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Возврат НовыйОтбор;
	
КонецФункции

#Область ПроверкаКМСредствамиККТ


Функция РежимыКонтроляСредствамиККТ() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	
	ВозвращаемоеЗначение.Вставить("ПриСканировании");
	ВозвращаемоеЗначение.Вставить("ПередПробитиемЧека");
	
	ЗаполнитьЗначенияКлючами(ВозвращаемоеЗначение);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция СохранитьРезультатПроверкиСредствамиККТ(РезультатПроверки, СсылкаНаОбъект) Экспорт
	
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.РезультатыПроверкиКМНаККТ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(СсылкаНаОбъект);
	
	Блокировка        = Новый БлокировкаДанных();
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.РезультатыПроверкиКМНаККТ");
	ЭлементБлокировки.УстановитьЗначение(Метаданные.РегистрыСведений.РезультатыПроверкиКМНаККТ.Измерения.Документ.Имя, СсылкаНаОбъект);
	
	Для Каждого СтрокаПроверки Из РезультатПроверки.ПроверяемыеКМ Цикл
		
		РезультатПроверкиПоСтроке = РезультатПроверки.ДанныеПроверки[СтрокаПроверки.УИД];
		
		//Если Не ЗначениеЗаполнено(РезультатПроверкиПоСтроке.ТекстОшибки)
		//	Или Не ЗначениеЗаполнено(СтрокаПроверки.ШтрихкодУпаковки) Тогда
		//	Продолжить;
		//КонецЕсли;
		
		НоваяСтрока = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПроверки);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, РезультатПроверкиПоСтроке);
		
		НоваяСтрока.Штрихкод = СтрокаПроверки.ШтрихкодУпаковки;
		
		НоваяСтрока.Документ = СсылкаНаОбъект;
		
	КонецЦикла;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка.Заблокировать();
		УстановитьПривилегированныйРежим(Истина);
		НаборЗаписей.Записать(Истина);
		УстановитьПривилегированныйРежим(Ложь);
		
		ЗафиксироватьТранзакцию();
		
		Возврат Истина;
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстСообщения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьЗначенияКлючами(Данные)

	Для Каждого КлючИЗначение Из Данные Цикл
			Данные[КлючИЗначение.Ключ] = КлючИЗначение.Ключ;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
